# GetSizeCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettings..::..GetSizeCount Method
DuctSizeSettings Class See Also
---
Get the size count of the duct size table. The duct shape determines the location of the size in the size table.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetSizeCount(
	DuctShape shape
)
```

Visual Basic
---
```text
Public Function GetSizeCount ( _
	shape As DuctShape _
) As Integer
```

Visual C++
---
```text
public:
int GetSizeCount(
	DuctShape shape
)
```

# ### Parameters
shape
    Type: Autodesk.Revit.DB.Mechanical..::..DuctShape The shape of duct.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace